fugreat/nrf52805_ble_uart/main.c
/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = NULL,
        .len    = 0

    }
};

#pragma pack(1)
typedef struct SERVICE_INFO_T{
    uint8_t type;
    uint8_t cmd;
    uint32_t rh; // 100倍
    uint32_t t;  // 放大10倍
    uint16_t status;
    uint8_t mac[6];
    uint8_t ran1;
    uint8_t ran2;
}SERVICE_INFO_T;

typedef struct DEVICE_INFO_T{
    uint8_t type;
    uint8_t cmd;
    uint8_t battery;
    uint16_t tx_rssi;
    uint16_t rx_rssi;
    uint8_t mac[6];
    uint8_t state;
    uint8_t ran1;
    uint8_t ran2;
}DEVICE_INFO_T;
#pragma pack()

static uint8_t sensor_info_data[] = {   0xA3, 0x01, 0x01, 0x00, 
                                        0x12, 0x00, 0x01, 0x00, 
                                        0x01, 0x01, 0x00, 0x00, 
                                        0x9B, 0xC8, 0xA4, 0x3F, 
                                        0x23, 0xAC, 0xC7, 0x72};

static uint8_t device_info_data[] = {   0xA3, 0x03, 0x64, 0x18, 
                                        0xb3, 0x2b, 0xb3, 0x9b, 
                                        0xc8, 0xa4, 0x3f, 0x23, 
                                        0xac, 0x00, 0x7a, 0xD2};


// const nrf_drv_timer_t TIMER_UART_RX = NRF_DRV_TIMER_INSTANCE(1);

static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */

/*
#define ADV_DATA_SENSOR_POS_OFFSET 7
static uint8_t m_enc_advdata_sensor[]={
    2, 0x01, 0x06,
    23,0xff, 0x39, 0x06, 0xA3, 0x01, 0x01, 0x00, 0x12, 0x00, 0x01, 0x00, 0x01, 0x01, 0x00, 0x00, 
                   0x9B, 0xC8, 0xA4, 0x3F, 0x23, 0xAC, 0xC7, 0x72,
    3, 0x09, 0x53, 0x33
};

#define ADV_DATA_INFO_POS_OFFSET 7
static uint8_t m_enc_advdata_info[]={
    2, 0x01, 0x06,
    23,0xff, 0x39, 0x06, 0xA3, 0x01, 0x01, 0x00, 0x12, 0x00, 0x01, 0x00, 0x01, 0x01, 0x00, 0x00, 
                   0x9B, 0xC8, 0xA4, 0x3F, 0x23, 0xAC, 0xC7, 0x72,
    3, 0x09, 0x53, 0x33
    
    // 2, 0x01, 0x06,
    // 19,0xff, 0x39, 0x06, 0xA3, 0x03, 
                        //  0x64, 0x18, 0xb3, 0x2b, 0xb3, 0x9b, 0xc8, 0xa4, 0x3f, 0x23, 0xac, 0x00, 0x7a, 0xD2,
    //3, 0x09, 0x53, 0x33
};
*/

// uint8_t m_enc_advdata_info[20];



//tatic uint8_t manuf_data_array[20]={0xA3, 0x01, 0x01, 0x00, 0x12, 0x00, 0x01, 0x00, 0x01, 0x01, 0x00, 0x00, 
//                   0x9B, 0xC8, 0xA4, 0x3F, 0x23, 0xAC, 0xC7, 0x72};


/**@brief Struct that contains pointers to the encoded advertising data. */
// static ble_gap_adv_data_t m_adv_data = {
//     .adv_data = {
//         .p_data = m_enc_advdata_info,
//         .len = BLE_GAP_ADV_SET_DATA_SIZE_MAX},
//     .scan_rsp_data = {.p_data = NULL, .len = 0}};

//
static void AT_cmd_handle(uint8_t *pBuffer, uint16_t length);
static uint8_t AT_cmd_check_valid(uint8_t *pBuffer, uint16_t length);



//对应int32大小的成员 的转换 范例 
int32_t swap_int32(int32_t value)
{
     return ((value & 0x000000FF) << 24) |
               ((value & 0x0000FF00) << 8) |
               ((value & 0x00FF0000) >> 8) |
               ((value & 0xFF000000) >> 24) ;
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for wdt feed timers.
 *
 * @details Starts application wdt feed timers.
 */
static void uart_timeout_timers_start(void)
{
    ret_code_t err_code;

    err_code = app_timer_start(m_uart_timeout_timer_id, UART_RX_DELAY_TIMEOUT, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for feed WDT.
 *
 * @param[in] p_context   Unused.
 */
static void uart_timeout_timer_handler(void *p_context)
{
    // start to dispatch
    app_timer_stop(m_uart_timeout_timer_id);

    NRF_LOG_HEXDUMP_INFO(UART_RX_BUF, UART_RX_STA);
    if (AT_cmd_check_valid(UART_RX_BUF, UART_RX_STA)) // AT command
    {
        NRF_LOG_INFO("Got AT");
        AT_cmd_handle(UART_RX_BUF, UART_RX_STA);
    }
    UART_RX_STA = 0;
}




/**@brief Function for wdt feed timers.
 *
 * @details Starts application wdt feed timers.
 */
static void task_timeout_timers_start(void)
{
    ret_code_t err_code;
    err_code = app_timer_start(m_task_timeout_timer_id, TASK_TIMEOUT, NULL);
    APP_ERROR_CHECK(err_code);
}


static uint8_t counter = 0;
static void task_timeout_timer_handler(void *p_context)
{
    // NRF_LOG_INFO("RUN TASK");
    counter++;
    if(counter & 0x01) {
        memcpy(m_adv_manuf_data, sensor_info_data, sizeof(sensor_info_data));
        m_adv_manuf_data_size = sizeof(sensor_info_data);
        // NRF_LOG_INFO("sensor info size= %d", m_adv_manuf_data_size);
    }else {
        memcpy(m_adv_manuf_data, device_info_data, sizeof(device_info_data));
        m_adv_manuf_data_size = sizeof(device_info_data);
        // NRF_LOG_INFO("device info size= %d", m_adv_manuf_data_size);
    }
    advertising_update();
    NRF_LOG_HEXDUMP_INFO(sensor_info_data, sizeof(SERVICE_INFO_T));
    NRF_LOG_HEXDUMP_INFO(device_info_data, sizeof(DEVICE_INFO_T));
}


static void task_timer_init(void){
    ret_code_t err_code;

    err_code = app_timer_create(&m_task_timeout_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                task_timeout_timer_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
    err_code = app_timer_create(&m_uart_timeout_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                uart_timeout_timer_handler);
    APP_ERROR_CHECK(err_code);
    task_timer_init();

