fugreat/nrf52805_ble_uart/main.c
    g_adv_params.primary_phy     = BLE_GAP_PHY_1MBPS;
    g_adv_params.duration        = APP_ADV_DURATION;
    g_adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
    g_adv_params.p_peer_addr     = NULL;
    g_adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;

    // Build and set Tile advertising data.
    memset(&g_advdata, 0, sizeof(g_advdata));

    g_advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    g_advdata.include_appearance      = false;
    g_advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    /* 定义制造商信息 */
    ble_advdata_manuf_data_t   manuf_specific_data;     /**< Manufacturer specific data. */
    /* 初始化清零 */ 
    memset(&manuf_specific_data, 0, sizeof(manuf_specific_data));
    /* 设置制造商参数 */
    manuf_specific_data.company_identifier = APP_COMPANY_IDENTIFIER;
    
    manuf_specific_data.data.size = m_adv_manuf_data_size;
    manuf_specific_data.data.p_data = m_adv_manuf_data;
    g_advdata.p_manuf_specific_data = &manuf_specific_data;    

    /* Get current advertising data and params */
    // (void) tile_gap_get_adv_params(&adv_interval, &tile_service_uuid, &tile_service_data_length, tile_service_data, &manuf);

    g_adv_params.interval = APP_ADV_INTERVAL;

    m_adv_data.adv_data.len = BLE_GAP_ADV_SET_DATA_SIZE_MAX;

    err_code = ble_advdata_encode(&g_advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &g_adv_params);
    APP_ERROR_CHECK(err_code);
}


/* Function to change Advertising data */
void advertising_update(void)
{
    // NRF_LOG_INFO("advertising_update");
    ret_code_t err_code;

    /* Stop Advertising, so as to enable it to be updated */
    err_code = sd_ble_gap_adv_stop(m_adv_handle);
    APP_ERROR_CHECK(err_code);
  
    /* Init Advertising data */ 
    advertising_init();

    /* Restart Advertising */
    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code); //����������

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    ret_code_t err_code;
      
    advertising_init();

    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for check uart received data whether is AT cmd or Pass-through data.
 *
 * @param[in] pBuffer   pointer of string.
 * @param[in] length	Length of the data.
 *
 * @retval 1 AT command
 * @retval 0 Pass-through data
 */
static uint8_t AT_cmd_check_valid(uint8_t *pBuffer, uint16_t length)
{
    // check whether is AT cmd or not
    if (length < 2)
    {
        return 0;
    }

    if (strncmp((char *)pBuffer, "AT", 2) != 0)
    {
        return 0;
    }

    return 1;
}

/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handler(app_uart_evt_t *p_event)
{
    switch (p_event->evt_type)
    {
    case APP_UART_DATA_READY:
        // nrf_drv_timer_disable(&TIMER_UART_RX);
        app_timer_stop(m_uart_timeout_timer_id);
        app_uart_get(&UART_RX_BUF[UART_RX_STA]);
        UART_RX_STA++; // Record the uart received data frame length
        uart_timeout_timers_start();
        break;

    case APP_UART_COMMUNICATION_ERROR:
        //APP_ERROR_HANDLER(p_event->data.error_communication);
        break;

    case APP_UART_FIFO_ERROR:
        APP_ERROR_HANDLER(p_event->data.error_code);
        break;

    default:
        break;
    }
}
/**@snippet [Handling the data received over UART] */

#define MY_RX_PIN_NUMBER 14
#define MY_TX_PIN_NUMBER 20


// #define MY_RX_PIN_NUMBER 20
// #define MY_TX_PIN_NUMBER 14
/**@brief  Function for initializing the UART module.
 *
 * @param[in] baudrate   uart baudrate 
 *
 * @return NRF_SUCCESS on success, otherwise an error code.  
 */
/**@snippet [UART Initialization] */
static uint32_t uart_init(uint32_t baudrate)
{
    uint32_t err_code;
    app_uart_comm_params_t const comm_params =
        {
            .rx_pin_no = MY_RX_PIN_NUMBER,
            .tx_pin_no = MY_TX_PIN_NUMBER,
            .rts_pin_no = UART_PIN_DISCONNECTED,
            .cts_pin_no = UART_PIN_DISCONNECTED,
            .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
            .use_parity = false,
            .baud_rate = baudrate};

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handler,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    //    APP_ERROR_CHECK(err_code);
    return err_code;
}
/**@snippet [UART Initialization] */

/**@brief Function for convert Bluetooth MAC address to string.
 *
 * @param[in] pAddr   Bluetooth MAC address.
 * 
 * @return BD address as a string.
 */
char *Util_convertBdAddr2Str(uint8_t *pAddr)
{
    uint8_t charCnt;
    char hex[] = "0123456789ABCDEF";
    static char str[(BLE_GAP_ADDR_LEN << 1) + 1];
    char *pStr = str;

    // Start from end of addr
    pAddr += BLE_GAP_ADDR_LEN;

    for (charCnt = BLE_GAP_ADDR_LEN; charCnt > 0; charCnt--)
    {
        *pStr++ = hex[*--pAddr >> 4];
        *pStr++ = hex[*pAddr & 0x0F];
    }

