fugreat/nrf52805_ble_uart/main.c
    pStr = NULL;

    return str;
}

uint8_t ad_data_dispatch(uint8_t *buf, uint8_t len, uint32_t *t_p, uint32_t *bat_p)
{
    if (buf == NULL || len < 5)
        return -1; // Frame invaild

    //
    char *delim = "+";
    char *p;
    // NRF_LOG_INFO("%s ", buf);

    p = strtok((char *)buf, delim); // 切 AT 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        NRF_LOG_INFO("STR1: %s", p);
    };

    p = strtok(NULL, delim); // 切 addr 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        NRF_LOG_INFO("STR2: %s",p);
    };

    p = strtok(NULL, delim); // 切  temperature 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        float v = atof(p)*10;
        *t_p = (uint32_t) v;
        NRF_LOG_INFO("STR3: %s %d", p, *t_p);

    };

    p = strtok(NULL, delim); // 切 battery 出来
    if (!p)
    {
        return -2; // PARSE FAIL
    }
    else
    {
        *bat_p = atoi(p);
        NRF_LOG_INFO("STR4:%s %d", p, *bat_p);

        return 0;
    }
    return -2;
}
/**@brief Function for process AT command.
 *
 * @param[in] pBuffer   pointer of string.
 * @param[in] length	Length of the data.
 */
static void AT_cmd_handle(uint8_t *pBuffer, uint16_t length)
{
    ret_code_t err_code;
    // 移除AT前的无效字符

    // AT test: AT?\r\n
    if ((length == 5) && (strncmp((char *)pBuffer, "AT?\r\n", 5) == 0))
    {
        printf("AT:OK\r\n");
    } else if ((length == 10) && (strncmp((char *)pBuffer, "AT+BAUD8\r\n", 10) == 0))
    {
        printf("AT+BAUD8:OK\r\n");
        NRF_LOG_INFO("AT+BAUD8:OK\r\n");

        // 41 54 2B 42 41 55 44 38|AT+BAUD8
        //  <info> app:  0D 0A 
    }else if ((length == 13) && (strncmp((char *)pBuffer, "AT+STARTEN0\r\n", 13) == 0))
    {
        printf("AT+STARTEN0:OK\r\n");
        NRF_LOG_INFO("AT+STARTEN0:OK\r\n");

        // 41 54 2B 42 41 55 44 38|AT+BAUD8
        //  <info> app:  0D 0A 
    } else if ((length == 11) && (strncmp((char *)pBuffer, "AT+ADVIN0\r\n", 11) == 0))
    {
        printf("AT+ADVIN0:OK\r\n");
        NRF_LOG_INFO("AT+ADVIN0:OK\r\n");

        // 41 54 2B 42 41 55 44 38|AT+BAUD8
        //  <info> app:  0D 0A 
    } else if ((length == 10) && (strncmp((char *)pBuffer, "AT+POWR0\r\n", 10) == 0))
    {
        printf("AT+POWR0:OK\r\n");
        NRF_LOG_INFO("AT+POWR0:OK\r\n");

        // 41 54 2B 42 41 55 44 38|AT+BAUD8
        //  <info> app:  0D 0A 
    }
     else if ((length == 14) && (strncmp((char *)pBuffer, "AT+NAME", 7) == 0))
    {

        printf("AT+NAMETH001:OK\r\n");
        NRF_LOG_INFO("AT+NAMETH001:OK\r\n");
        // 41 54 2B 42 41 55 44 38|AT+BAUD8
        //  <info> app:  0D 0A 
    }

    // System soft reset: AT+RESET\r\n
    else if ((length == 8) && (strncmp((char *)pBuffer, "AT+RST\r\n", 8) == 0))
    {
       // NVIC_SystemReset(); // Restart the system by default
        printf("AT+RST:OK\r\n");
        NRF_LOG_INFO("AT+RST:OK\r\n");
    }

    else if ((length >= 10) && (strncmp((char *)pBuffer, "AT+NFTH", 7) == 0))
    {

        // 获取mac地址
        ble_gap_addr_t device_addr;
        #if (NRF_SD_BLE_API_VERSION >= 3)
        err_code = sd_ble_gap_addr_get(&device_addr);
        #else
        err_code = sd_ble_gap_address_get(&device_addr);
        #endif
        APP_ERROR_CHECK(err_code);
  
        // 准备数据结构
        uint32_t t_value_x10 =0;
        uint32_t b_value = 0;

        // to do 解析出温度和电量
        int8_t res = ad_data_dispatch(pBuffer, length, &t_value_x10, &b_value);
        if (res)
            return; // 解析不正确 直接退出
            
        NRF_LOG_INFO("T=%d, BAT=%d", t_value_x10, b_value);

        DEVICE_INFO_T *di_p =(DEVICE_INFO_T *) (device_info_data);
        SERVICE_INFO_T *si_p =( SERVICE_INFO_T *) (sensor_info_data); 
        // 
        di_p->battery = (b_value&0xFF);
        memcpy(di_p->mac, device_addr.addr, 6);
        //
        memcpy(si_p->mac, device_addr.addr, 6); 
        si_p->rh = swap_int32(0x00000000 | 0x01000000);
        si_p->t = swap_int32((t_value_x10) | 0x01000000);

        if (err_code == NRF_SUCCESS)
        {
            printf("AT+NFTH:OK\r\n");
        }
        else
        {
            printf("AT+NFTH:FAIL\r\n");
        }
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Application main function.
 */

int main(void)
{
    // Initialize.
    log_init();
    timers_init();
    uart_init(NRF_UARTE_BAUDRATE_115200);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Debug logging for UART over RTT started.");

    advertising_start();

    task_timeout_timers_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}

/**
 * @}
 */
